KAVATER/Digital-Signal-Processing-using-STM32/Intigrating_CMSIS_DSP/Src/main.c
#include "stm32f407xx.h"
#include "signals.h"
#include "uart.h"
#include "stdio.h"
#include "arm_math.h"

#define GPIOAEN  (1U<<0)
#define PIN5    (1U<<5)
#define LED_PIN  PIN5

//#define ITM_PORT0 (*(volatile uint32_t *)0xE0000000)

extern float _5hz_signal[301];
extern float32_t inputSignal_f32_1kHz_15kHz[320];

static void plot_input_signal(void);
static void sudo_delay(uint16_t dly);

float in_sig_sample;
static void fpu_enable(void);
static void serial_plotter(void);


int main ()
{

   fpu_enable();

	/* Initilaize the uart*/
	uart2_tx_init();

	while(1)
	{
		//printf("Hello from stm32...\n\r");
		plot_input_signal();
		serial_plotter();

	}
}

static void fpu_enable(void)
{
	/*Enable the floating point unit*/
	SCB->CPACR |=((3UL << 10*2) | (3UL << 11*2)); // arm cortex m device generic user guide
	// or

//	SCB->CPACR |= (1U<<20);
//	SCB->CPACR |= (1U<<21);
//	SCB->CPACR |= (1U<<22);
//	SCB->CPACR |= (1U<<23);
}

static void serial_plotter(void)
{
	for(int i=0; i<320; i++)
	{
	    printf("%f\r\n",inputSignal_f32_1kHz_15kHz[i] );
		//printf("%ld\r\n", (long)(_5hz_signal[i] * 100000));
		sudo_delay(9000);
	}
}

static void plot_input_signal(void)
{
	int i;
	for(i=0; i<320; i++)
	{
		in_sig_sample = inputSignal_f32_1kHz_15kHz[i];
		sudo_delay(9000);
	}
}
static void sudo_delay(uint16_t dly)
{
	for(volatile int j = 0; j<dly; j++){}
}
